#!/usr/bin/env bash

# CSS 实战手册（第四版）

open "https://github.com/sawmac/css_mm_4e"
open "https://book.douban.com/subject/26898555/annotation?sort=page"


#    The Missing Manual 团队.1
#    前言 5
# 第一部分 CSS 基础知识
# 第1章 HTML和CSS 17
#    HTML的过去和现在 17
#    编写HTML时兼顾CSS 19
#    文档类型的重要性30
#    CSS的运作方式 31
# 第2章编写样式和样式表 33
#    剖析样式33
#    解读样式表 36
#    内部样式表 37
#    外部样式表 38
#    教程：首次编写样式 39
#    第3章选择符：标识要装饰的目标 51
#    类型选择符：选取HTML标签 51
#    类选择符：精确控制 53
#    ID选择符：选取网页中具体的元素 56
#    给标签组定义样式58
#    为标签里的标签定义样式60
#    伪类和伪元素64
#    属性选择符 69
#    子代选择符 71
#    同辈选择符 77
#    :target 选择符78
#    :not()选择符79
#    教程：选择符示例80
#    第4章继承样式，节省时间 95
#    什么是继承？95
#    继承如何简化样式表 96
#    继承的局限性98
#    教程：继承 98
#    第5章管理多个样式：层叠 105
#    样式层叠的方式 106
#    特指度：确定哪个样式胜出 110
#    控制层叠 113
#    教程：层叠实战 119
#    第二部分 CSS实用技术第6章装饰文本 129
#    使用字体 129
#    使用Web 字体 134
#    使用Google 提供的Web 字体服务 149
#    为文本着色 156
#    修改字号 160
#    装饰词语和字符 165
#    为文本添加投影 169
#    装饰整个段落 170
#    装饰列表 177
#    教程：装饰文本实战 181
#    第7章外边距、内边距和边框 193
#    理解盒模型 193
#    使用内外边距控制空白 195
#    添加边框 201
#    添加背景色 205
#    创建圆角 206
#    添加投影 208
#    确定高度和宽度 211
#    把内容放在浮动元素里 217
#    教程：边距，背景和边框 222
#    第8章把图形添加到网页中 233
#    使用CSS装饰 标签 233
#    添加背景图 234
#    控制平铺方式 238
#    定位背景图 240
#    使用简写的background 属性 250
#    使用多个背景图 252
#    使用渐变背景 254
#    教程：美化图像 263
#    教程：创建相册 268
#    教程：使用背景图 271
#    第9章装饰网站的导航 279
#    选择要装饰的链接 279
#    装饰链接 283
#    创建导航栏 289
#    使用CSS创建预先加载图像的翻转效果 298
#    装饰特定类型的链接 299
#    教程：装饰链接 301
#    教程：创建导航栏 307
#    第10章 CSS变形，过渡和动画 317
#    变形 317
#    过渡 327
#    动画 335
#    教程 346
#    第11章装饰表格和表单 353
#    表格的正确用途 353
#    装饰表格 355
#    装饰表单 361
#    教程：装饰一个表格 365
#    教程：装饰一个表单 370
#    第三部分 CSS页面布局第12章 CSS布局简介 379
#    网页布局的类型 379
#    如何使用CSS布局 381
#    布局策略 385
#    第13章构建基于浮动的布局 391
#    活用浮动布局 394
#    解决浮动问题 399
#    教程：多栏布局 411
#    第14章定位网页中的元素 423
#    定位属性的工作原理 423
#    有效的定位策略 436
#    教程：定位页面中的元素 441
# 第15章响应式Web 设计 449
#    响应式Web 设计基础 449
#    为响应式Web 设计设置网页 451
#    媒体查询 452
#    弹性栅格 459
#    可变尺寸图像 464
#    响应式Web设计教程 468
# 第16章使用CSS栅格系统 483
#    栅格的工作原理 483
#    为栅格搭建HTML结构 485
#    使用Skeleton 栅格系统 487
#    创建并划分列 490
#    教程：使用栅格系统 498
# 第17章 Web 布局新方法：弹性盒 513
#    弹性盒简介 513
#    弹性容器相关的属性 516
#    弹性项目相关的属性 525
#    教程：使用弹性盒构建布局 539
#    第四部分 CSS高级话题
# 第18章改善编写CSS的习惯 551
#    添加注释 551
#    合理组织样式 553
#    消除浏览器对样式的干扰 560
#    使用后代选择符 564
# 第19章使用Sass增强样式 571
#    Sass是什么 571
#    安装Sass 573
#    Sass基础知识 576
#    使用Sass局部文件组织样式 580
#    Sass变量 584
#    嵌套选择符 588
#    继承（或扩展）属性 593
#    混入 598
#    处理媒体查询 606
#    使用CSS源码映射诊断故障 610
#    第五部分附录附录A CSS 属性参考 615
#    附录B CSS资源 653
